MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_xbar.h
/**
 * @defgroup XBAR_HRPWM_MINDB_Selection XBAR HRPWM Minimum Dead Time Selection
 * @{
 */
#define XBAR_HRPWM_MINDB_PWMA_SWAP_NO_HP1 (0UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMA_SWAP_NO_HP1 */
#define XBAR_HRPWM_MINDB_PWMA_SWAP_NO_HP2 (1UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMA_SWAP_NO_HP2 */
#define XBAR_HRPWM_MINDB_PWMA_SWAP_NO_HP3 (2UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMA_SWAP_NO_HP3 */
#define XBAR_HRPWM_MINDB_PWMA_SWAP_NO_HP4 (3UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMA_SWAP_NO_HP4 */
#define XBAR_HRPWM_MINDB_PWMA_SWAP_NO_HP5 (4UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMA_SWAP_NO_HP5 */
#define XBAR_HRPWM_MINDB_PWMA_SWAP_NO_HP6 (5UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMA_SWAP_NO_HP6 */
#define XBAR_HRPWM_MINDB_PWMA_SWAP_NO_HP7 (6UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMA_SWAP_NO_HP7 */
#define XBAR_HRPWM_MINDB_PWMA_SWAP_NO_HP8 (7UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMA_SWAP_NO_HP8 */
#define XBAR_HRPWM_MINDB_PWMB_SWAP_NO_HP1 (8UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMB_SWAP_NO_HP1 */
#define XBAR_HRPWM_MINDB_PWMB_SWAP_NO_HP2 (9UL << XBAR_MICR_MDSEL_POS)  /*!< HRPWM_PWMB_SWAP_NO_HP2 */
#define XBAR_HRPWM_MINDB_PWMB_SWAP_NO_HP3 (10UL << XBAR_MICR_MDSEL_POS) /*!< HRPWM_PWMB_SWAP_NO_HP3 */
#define XBAR_HRPWM_MINDB_PWMB_SWAP_NO_HP4 (11UL << XBAR_MICR_MDSEL_POS) /*!< HRPWM_PWMB_SWAP_NO_HP4 */
#define XBAR_HRPWM_MINDB_PWMB_SWAP_NO_HP5 (12UL << XBAR_MICR_MDSEL_POS) /*!< HRPWM_PWMB_SWAP_NO_HP5 */
#define XBAR_HRPWM_MINDB_PWMB_SWAP_NO_HP6 (13UL << XBAR_MICR_MDSEL_POS) /*!< HRPWM_PWMB_SWAP_NO_HP6 */
#define XBAR_HRPWM_MINDB_PWMB_SWAP_NO_HP7 (14UL << XBAR_MICR_MDSEL_POS) /*!< HRPWM_PWMB_SWAP_NO_HP7 */
#define XBAR_HRPWM_MINDB_PWMB_SWAP_NO_HP8 (15UL << XBAR_MICR_MDSEL_POS) /*!< HRPWM_PWMB_SWAP_NO_HP8 */
#define XBAR_HRPWM_MINDB_PLA_OUT0         (16UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT0 */
#define XBAR_HRPWM_MINDB_PLA_OUT1         (17UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT1 */
#define XBAR_HRPWM_MINDB_PLA_OUT2         (18UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT2 */
#define XBAR_HRPWM_MINDB_PLA_OUT3         (19UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT3 */
#define XBAR_HRPWM_MINDB_PLA_OUT4         (20UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT4 */
#define XBAR_HRPWM_MINDB_PLA_OUT5         (21UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT5 */
#define XBAR_HRPWM_MINDB_PLA_OUT6         (22UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT6 */
#define XBAR_HRPWM_MINDB_PLA_OUT7         (23UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT7 */
#define XBAR_HRPWM_MINDB_PLA_OUT8         (24UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT8 */
#define XBAR_HRPWM_MINDB_PLA_OUT9         (25UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT9 */
#define XBAR_HRPWM_MINDB_PLA_OUT10        (26UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT10 */
#define XBAR_HRPWM_MINDB_PLA_OUT11        (27UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT11 */
#define XBAR_HRPWM_MINDB_PLA_OUT12        (28UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT12 */
#define XBAR_HRPWM_MINDB_PLA_OUT13        (29UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT13 */
#define XBAR_HRPWM_MINDB_PLA_OUT14        (30UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT14 */
#define XBAR_HRPWM_MINDB_PLA_OUT15        (31UL << XBAR_MICR_MDSEL_POS) /*!< PLA_OUT15 */
/**
 * @}
 */

/**
 * @defgroup XBAR_HRPWM_Illegal_Input_Event_Selection XBAR HRPWM Illegal Input Event Selection
 * @{
 */
#define XBAR_HRPWM_ICL_PWMA_MINDB_NO_HP1 (0UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMA MINDB NO HP1 */
#define XBAR_HRPWM_ICL_PWMA_MINDB_NO_HP2 (1UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMA MINDB NO HP2 */
#define XBAR_HRPWM_ICL_PWMA_MINDB_NO_HP3 (2UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMA MINDB NO HP3 */
#define XBAR_HRPWM_ICL_PWMA_MINDB_NO_HP4 (3UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMA MINDB NO HP4 */
#define XBAR_HRPWM_ICL_PWMA_MINDB_NO_HP5 (4UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMA MINDB NO HP5 */
#define XBAR_HRPWM_ICL_PWMA_MINDB_NO_HP6 (5UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMA MINDB NO HP6 */
#define XBAR_HRPWM_ICL_PWMA_MINDB_NO_HP7 (6UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMA MINDB NO HP7 */
#define XBAR_HRPWM_ICL_PWMA_MINDB_NO_HP8 (7UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMA MINDB NO HP8 */
#define XBAR_HRPWM_ICL_PWMB_MINDB_NO_HP1 (8UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMB MINDB NO HP1 */
#define XBAR_HRPWM_ICL_PWMB_MINDB_NO_HP2 (9UL << XBAR_MICR_ICLSEL_POS)  /*!< HRPWM PWMB MINDB NO HP2 */
#define XBAR_HRPWM_ICL_PWMB_MINDB_NO_HP3 (10UL << XBAR_MICR_ICLSEL_POS) /*!< HRPWM PWMB MINDB NO HP3 */
#define XBAR_HRPWM_ICL_PWMB_MINDB_NO_HP4 (11UL << XBAR_MICR_ICLSEL_POS) /*!< HRPWM PWMB MINDB NO HP4 */
#define XBAR_HRPWM_ICL_PWMB_MINDB_NO_HP5 (12UL << XBAR_MICR_ICLSEL_POS) /*!< HRPWM PWMB MINDB NO HP5 */
#define XBAR_HRPWM_ICL_PWMB_MINDB_NO_HP6 (13UL << XBAR_MICR_ICLSEL_POS) /*!< HRPWM PWMB MINDB NO HP6 */
#define XBAR_HRPWM_ICL_PWMB_MINDB_NO_HP7 (14UL << XBAR_MICR_ICLSEL_POS) /*!< HRPWM PWMB MINDB NO HP7 */
#define XBAR_HRPWM_ICL_PWMB_MINDB_NO_HP8 (15UL << XBAR_MICR_ICLSEL_POS) /*!< HRPWM PWMB MINDB NO HP8 */
#define XBAR_HRPWM_ICL_PLA_OUT0          (16UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT0 */
#define XBAR_HRPWM_ICL_PLA_OUT1          (17UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT1 */
#define XBAR_HRPWM_ICL_PLA_OUT2          (18UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT2 */
#define XBAR_HRPWM_ICL_PLA_OUT3          (19UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT3 */
#define XBAR_HRPWM_ICL_PLA_OUT4          (20UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT4 */
#define XBAR_HRPWM_ICL_PLA_OUT5          (21UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT5 */
#define XBAR_HRPWM_ICL_PLA_OUT6          (22UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT6 */
#define XBAR_HRPWM_ICL_PLA_OUT7          (23UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT7 */
#define XBAR_HRPWM_ICL_PLA_OUT8          (24UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT8 */
#define XBAR_HRPWM_ICL_PLA_OUT9          (25UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT9 */
#define XBAR_HRPWM_ICL_PLA_OUT10         (26UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT10 */
#define XBAR_HRPWM_ICL_PLA_OUT11         (27UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT11 */
#define XBAR_HRPWM_ICL_PLA_OUT12         (28UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT12 */
#define XBAR_HRPWM_ICL_PLA_OUT13         (29UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT13 */
#define XBAR_HRPWM_ICL_PLA_OUT14         (30UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT14 */
#define XBAR_HRPWM_ICL_PLA_OUT15         (31UL << XBAR_MICR_ICLSEL_POS) /*!< PLA_OUT15 */
/**
 * @}
 */
/**
 * @}
 */

/**
 * @defgroup XBAR_HRPWM_EMB_Event_Selection XBAR HRPWM EMB(HRPWMEMB) Event Selection
 * @{
 */
/**
 * @defgroup XBAR_HRPWM_EMB_EVT1_Event_Selection XBAR HRPWM EMB EVT1 Event Selection
 * @{
 */
#define XBAR_HRPWM_EMB_EVT1_PA12 (0UL << XBAR_HEBCR_SEL1_POS)  /*!< PA12 */
#define XBAR_HRPWM_EMB_EVT1_PA13 (1UL << XBAR_HEBCR_SEL1_POS)  /*!< PA13 */
#define XBAR_HRPWM_EMB_EVT1_PA14 (2UL << XBAR_HEBCR_SEL1_POS)  /*!< PA14 */
#define XBAR_HRPWM_EMB_EVT1_PA15 (3UL << XBAR_HEBCR_SEL1_POS)  /*!< PA15 */
#define XBAR_HRPWM_EMB_EVT1_PB3  (4UL << XBAR_HEBCR_SEL1_POS)  /*!< PB3 */
#define XBAR_HRPWM_EMB_EVT1_PB5  (5UL << XBAR_HEBCR_SEL1_POS)  /*!< PB5 */
#define XBAR_HRPWM_EMB_EVT1_PB6  (6UL << XBAR_HEBCR_SEL1_POS)  /*!< PB6 */
#define XBAR_HRPWM_EMB_EVT1_PB7  (7UL << XBAR_HEBCR_SEL1_POS)  /*!< PB7 */
#define XBAR_HRPWM_EMB_EVT1_PB8  (8UL << XBAR_HEBCR_SEL1_POS)  /*!< PB8 */
#define XBAR_HRPWM_EMB_EVT1_PB9  (9UL << XBAR_HEBCR_SEL1_POS)  /*!< PB9 */
#define XBAR_HRPWM_EMB_EVT1_PC10 (10UL << XBAR_HEBCR_SEL1_POS) /*!< PC10 */
#define XBAR_HRPWM_EMB_EVT1_PC11 (11UL << XBAR_HEBCR_SEL1_POS) /*!< PC11 */
#define XBAR_HRPWM_EMB_EVT1_PC12 (12UL << XBAR_HEBCR_SEL1_POS) /*!< PC12 */
#define XBAR_HRPWM_EMB_EVT1_PD0  (13UL << XBAR_HEBCR_SEL1_POS) /*!< PD0 */
#define XBAR_HRPWM_EMB_EVT1_PD1  (14UL << XBAR_HEBCR_SEL1_POS) /*!< PD1 */
#define XBAR_HRPWM_EMB_EVT1_PD2  (15UL << XBAR_HEBCR_SEL1_POS) /*!< PD2 */
#define XBAR_HRPWM_EMB_EVT1_PD3  (16UL << XBAR_HEBCR_SEL1_POS) /*!< PD3 */
#define XBAR_HRPWM_EMB_EVT1_PD4  (17UL << XBAR_HEBCR_SEL1_POS) /*!< PD4 */
#define XBAR_HRPWM_EMB_EVT1_PD5  (18UL << XBAR_HEBCR_SEL1_POS) /*!< PD5 */
#define XBAR_HRPWM_EMB_EVT1_PD6  (19UL << XBAR_HEBCR_SEL1_POS) /*!< PD6 */
#define XBAR_HRPWM_EMB_EVT1_PD7  (20UL << XBAR_HEBCR_SEL1_POS) /*!< PD7 */
#define XBAR_HRPWM_EMB_EVT1_PE0  (21UL << XBAR_HEBCR_SEL1_POS) /*!< PE0 */
#define XBAR_HRPWM_EMB_EVT1_PE1  (22UL << XBAR_HEBCR_SEL1_POS) /*!< PE1 */
#define XBAR_HRPWM_EMB_EVT1_PE2  (23UL << XBAR_HEBCR_SEL1_POS) /*!< PE2 */
#define XBAR_HRPWM_EMB_EVT1_PE3  (24UL << XBAR_HEBCR_SEL1_POS) /*!< PE3 */
#define XBAR_HRPWM_EMB_EVT1_PE4  (25UL << XBAR_HEBCR_SEL1_POS) /*!< PE4 */
#define XBAR_HRPWM_EMB_EVT1_PE5  (26UL << XBAR_HEBCR_SEL1_POS) /*!< PE5 */
#define XBAR_HRPWM_EMB_EVT1_PE6  (27UL << XBAR_HEBCR_SEL1_POS) /*!< PE6 */
#define XBAR_HRPWM_EMB_EVT1_PF2  (28UL << XBAR_HEBCR_SEL1_POS) /*!< PF2 */
#define XBAR_HRPWM_EMB_EVT1_PF3  (29UL << XBAR_HEBCR_SEL1_POS) /*!< PF3 */
#define XBAR_HRPWM_EMB_EVT1_PF4  (30UL << XBAR_HEBCR_SEL1_POS) /*!< PF4 */
#define XBAR_HRPWM_EMB_EVT1_PF5  (31UL << XBAR_HEBCR_SEL1_POS) /*!< PF5 */
#define XBAR_HRPWM_EMB_EVT1_PF6  (32UL << XBAR_HEBCR_SEL1_POS) /*!< PF6 */
#define XBAR_HRPWM_EMB_EVT1_PF7  (33UL << XBAR_HEBCR_SEL1_POS) /*!< PF7 */
#define XBAR_HRPWM_EMB_EVT1_PF8  (34UL << XBAR_HEBCR_SEL1_POS) /*!< PF8 */
#define XBAR_HRPWM_EMB_EVT1_PF9  (35UL << XBAR_HEBCR_SEL1_POS) /*!< PF9 */
#define XBAR_HRPWM_EMB_EVT1_PF10 (36UL << XBAR_HEBCR_SEL1_POS) /*!< PF10 */
#define XBAR_HRPWM_EMB_EVT1_PF11 (37UL << XBAR_HEBCR_SEL1_POS) /*!< PF11 */
#define XBAR_HRPWM_EMB_EVT1_PF12 (38UL << XBAR_HEBCR_SEL1_POS) /*!< PF12 */
#define XBAR_HRPWM_EMB_EVT1_PF13 (39UL << XBAR_HEBCR_SEL1_POS) /*!< PF13 */
#define XBAR_HRPWM_EMB_EVT1_PF14 (40UL << XBAR_HEBCR_SEL1_POS) /*!< PF14 */
#define XBAR_HRPWM_EMB_EVT1_PF15 (41UL << XBAR_HEBCR_SEL1_POS) /*!< PF15 */
#define XBAR_HRPWM_EMB_EVT1_PG0  (42UL << XBAR_HEBCR_SEL1_POS) /*!< PG0 */
#define XBAR_HRPWM_EMB_EVT1_PG1  (43UL << XBAR_HEBCR_SEL1_POS) /*!< PG1 */
#define XBAR_HRPWM_EMB_EVT1_PG2  (44UL << XBAR_HEBCR_SEL1_POS) /*!< PG2 */
#define XBAR_HRPWM_EMB_EVT1_PG3  (45UL << XBAR_HEBCR_SEL1_POS) /*!< PG3 */
#define XBAR_HRPWM_EMB_EVT1_PG4  (46UL << XBAR_HEBCR_SEL1_POS) /*!< PG4 */
#define XBAR_HRPWM_EMB_EVT1_PG5  (47UL << XBAR_HEBCR_SEL1_POS) /*!< PG5 */
#define XBAR_HRPWM_EMB_EVT1_PG6  (48UL << XBAR_HEBCR_SEL1_POS) /*!< PG6 */
#define XBAR_HRPWM_EMB_EVT1_PG7  (49UL << XBAR_HEBCR_SEL1_POS) /*!< PG7 */
#define XBAR_HRPWM_EMB_EVT1_PG8  (50UL << XBAR_HEBCR_SEL1_POS) /*!< PG8 */
#define XBAR_HRPWM_EMB_EVT1_PG9  (51UL << XBAR_HEBCR_SEL1_POS) /*!< PG9 */
/**
 * @}
 */

/**
 * @defgroup XBAR_HRPWM_EMB_EVT2_Selection XBAR HRPWM EMB EVT2 Selection
 * @{
 */
#define XBAR_HRPWM_EMB_EVT2_CMP1 (0UL << XBAR_HEBCR_SEL2_POS) /*!< CMP1 */
#define XBAR_HRPWM_EMB_EVT2_CMP2 (1UL << XBAR_HEBCR_SEL2_POS) /*!< CMP2 */
#define XBAR_HRPWM_EMB_EVT2_CMP3 (2UL << XBAR_HEBCR_SEL2_POS) /*!< CMP3 */
#define XBAR_HRPWM_EMB_EVT2_CMP4 (3UL << XBAR_HEBCR_SEL2_POS) /*!< CMP4 */
#define XBAR_HRPWM_EMB_EVT2_CMP5 (4UL << XBAR_HEBCR_SEL2_POS) /*!< CMP5 */
#define XBAR_HRPWM_EMB_EVT2_CMP6 (5UL << XBAR_HEBCR_SEL2_POS) /*!< CMP6 */
#define XBAR_HRPWM_EMB_EVT2_CMP7 (6UL << XBAR_HEBCR_SEL2_POS) /*!< CMP7 */
#define XBAR_HRPWM_EMB_EVT2_CMP8 (7UL << XBAR_HEBCR_SEL2_POS) /*!< CMP8 */
/**
 * @}
 */

/**
 * @defgroup XBAR_HRPWM_EMB_EVT3_Selection XBAR HRPWM EMB EVT3 Selection
 * @{
 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_BK0          (0UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_BK0 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_BK1          (1UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_BK1 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_BK2          (2UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_BK2 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_BK3          (3UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_BK3 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_CEVT1_0      (4UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_CEVT1_0 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_CEVT1_1      (5UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_CEVT1_1 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_CEVT1_2      (6UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_CEVT1_2 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_CEVT1_3      (7UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_CEVT1_3 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_CEVT2_0      (8UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_CEVT2_0 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_CEVT2_1      (9UL << XBAR_HEBCR_SEL3_POS)  /*!< SDFM_CEVT2_1 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_CEVT2_2      (10UL << XBAR_HEBCR_SEL3_POS) /*!< SDFM_CEVT2_2 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_CEVT2_3      (11UL << XBAR_HEBCR_SEL3_POS) /*!< SDFM_CEVT2_3 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_ZCD0         (12UL << XBAR_HEBCR_SEL3_POS) /*!< SDFM_ZCD0 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_ZCD1         (13UL << XBAR_HEBCR_SEL3_POS) /*!< SDFM_ZCD1 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_ZCD2         (14UL << XBAR_HEBCR_SEL3_POS) /*!< SDFM_ZCD2 */
#define XBAR_HRPWM_EMB_EVT3_SDFM_ZCD3         (15UL << XBAR_HEBCR_SEL3_POS) /*!< SDFM_ZCD3 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT0          (16UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT0 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT1          (17UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT1 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT2          (18UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT2 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT3          (19UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT3 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT4          (20UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT4 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT5          (21UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT5 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT6          (22UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT6 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT7          (23UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT7 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT8          (24UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT8 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT9          (25UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT9 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT10         (26UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT10 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT11         (27UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT11 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT12         (28UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT12 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT13         (29UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT13 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT14         (30UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT14 */
#define XBAR_HRPWM_EMB_EVT3_PLA_OUT15         (31UL << XBAR_HEBCR_SEL3_POS) /*!< PLA_OUT15 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT1        (32UL << XBAR_HEBCR_SEL3_POS) /*!< External event1 output by the HRPWM module OUT1 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT2        (33UL << XBAR_HEBCR_SEL3_POS) /*!< External event2 output by the HRPWM module OUT2 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT3        (34UL << XBAR_HEBCR_SEL3_POS) /*!< External event3 output by the HRPWM module OUT3 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT4        (35UL << XBAR_HEBCR_SEL3_POS) /*!< External event4 output by the HRPWM module OUT4 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT5        (36UL << XBAR_HEBCR_SEL3_POS) /*!< External event5 output by the HRPWM module OUT5 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT6        (37UL << XBAR_HEBCR_SEL3_POS) /*!< External event6 output by the HRPWM module OUT6 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT7        (38UL << XBAR_HEBCR_SEL3_POS) /*!< External event7 output by the HRPWM module OUT7 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT8        (39UL << XBAR_HEBCR_SEL3_POS) /*!< External event8 output by the HRPWM module OUT8 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT9        (40UL << XBAR_HEBCR_SEL3_POS) /*!< External event9 output by the HRPWM module OUT9 */
#define XBAR_HRPWM_EMB_EVT3_HRPWM_OUT10       (41UL << XBAR_HEBCR_SEL3_POS) /*!< External event10 output by the HRPWM module OUT10 */
#define XBAR_HRPWM_EMB_EVT3_DSOGI_PLL_FAILURE (42UL << XBAR_HEBCR_SEL3_POS) /*!< DSOGI_PLL phase locking failure */
/**
 * @}
 */
/**
 * @}
 */

/**
 * @defgroup XBAR_TMR6_EMB_Event_Selection XBAR TMR6 EMB(TMR6EMB) Event Selection
 * @{
 */
#define XBAR_TMR6_EMB_PA12         (0UL << XBAR_TECR_TESEL_POS)  /*!< PA12 */
#define XBAR_TMR6_EMB_PA13         (1UL << XBAR_TECR_TESEL_POS)  /*!< PA13 */
#define XBAR_TMR6_EMB_PA14         (2UL << XBAR_TECR_TESEL_POS)  /*!< PA14 */
#define XBAR_TMR6_EMB_PA15         (3UL << XBAR_TECR_TESEL_POS)  /*!< PA15 */
#define XBAR_TMR6_EMB_PB3          (4UL << XBAR_TECR_TESEL_POS)  /*!< PB3 */
#define XBAR_TMR6_EMB_PB5          (5UL << XBAR_TECR_TESEL_POS)  /*!< PB5 */
#define XBAR_TMR6_EMB_PB6          (6UL << XBAR_TECR_TESEL_POS)  /*!< PB6 */
#define XBAR_TMR6_EMB_PB7          (7UL << XBAR_TECR_TESEL_POS)  /*!< PB7 */
#define XBAR_TMR6_EMB_PB8          (8UL << XBAR_TECR_TESEL_POS)  /*!< PB8 */
#define XBAR_TMR6_EMB_PB9          (9UL << XBAR_TECR_TESEL_POS)  /*!< PB9 */
#define XBAR_TMR6_EMB_PC10         (10UL << XBAR_TECR_TESEL_POS) /*!< PC10 */
#define XBAR_TMR6_EMB_PC11         (11UL << XBAR_TECR_TESEL_POS) /*!< PC11 */
#define XBAR_TMR6_EMB_PC12         (12UL << XBAR_TECR_TESEL_POS) /*!< PC12 */
#define XBAR_TMR6_EMB_PD0          (13UL << XBAR_TECR_TESEL_POS) /*!< PD0 */
#define XBAR_TMR6_EMB_PD1          (14UL << XBAR_TECR_TESEL_POS) /*!< PD1 */
#define XBAR_TMR6_EMB_PD2          (15UL << XBAR_TECR_TESEL_POS) /*!< PD2 */
#define XBAR_TMR6_EMB_PD3          (16UL << XBAR_TECR_TESEL_POS) /*!< PD3 */
#define XBAR_TMR6_EMB_PD4          (17UL << XBAR_TECR_TESEL_POS) /*!< PD4 */
#define XBAR_TMR6_EMB_PD5          (18UL << XBAR_TECR_TESEL_POS) /*!< PD5 */
#define XBAR_TMR6_EMB_PD6          (19UL << XBAR_TECR_TESEL_POS) /*!< PD6 */
#define XBAR_TMR6_EMB_PD7          (20UL << XBAR_TECR_TESEL_POS) /*!< PD7 */
#define XBAR_TMR6_EMB_PE0          (21UL << XBAR_TECR_TESEL_POS) /*!< PE0 */
#define XBAR_TMR6_EMB_PE1          (22UL << XBAR_TECR_TESEL_POS) /*!< PE1 */
#define XBAR_TMR6_EMB_PE2          (23UL << XBAR_TECR_TESEL_POS) /*!< PE2 */
#define XBAR_TMR6_EMB_PE3          (24UL << XBAR_TECR_TESEL_POS) /*!< PE3 */
#define XBAR_TMR6_EMB_PE4          (25UL << XBAR_TECR_TESEL_POS) /*!< PE4 */
#define XBAR_TMR6_EMB_PE5          (26UL << XBAR_TECR_TESEL_POS) /*!< PE5 */
#define XBAR_TMR6_EMB_PE6          (27UL << XBAR_TECR_TESEL_POS) /*!< PE6 */
#define XBAR_TMR6_EMB_PF2          (28UL << XBAR_TECR_TESEL_POS) /*!< PF2 */
#define XBAR_TMR6_EMB_PF3          (29UL << XBAR_TECR_TESEL_POS) /*!< PF3 */
#define XBAR_TMR6_EMB_PF4          (30UL << XBAR_TECR_TESEL_POS) /*!< PF4 */
#define XBAR_TMR6_EMB_PF5          (31UL << XBAR_TECR_TESEL_POS) /*!< PF5 */
#define XBAR_TMR6_EMB_PF6          (32UL << XBAR_TECR_TESEL_POS) /*!< PF6 */
#define XBAR_TMR6_EMB_PF7          (33UL << XBAR_TECR_TESEL_POS) /*!< PF7 */
#define XBAR_TMR6_EMB_PF8          (34UL << XBAR_TECR_TESEL_POS) /*!< PF8 */
#define XBAR_TMR6_EMB_PF9          (35UL << XBAR_TECR_TESEL_POS) /*!< PF9 */
#define XBAR_TMR6_EMB_PF10         (36UL << XBAR_TECR_TESEL_POS) /*!< PF10 */
#define XBAR_TMR6_EMB_PF11         (37UL << XBAR_TECR_TESEL_POS) /*!< PF11 */
#define XBAR_TMR6_EMB_PF12         (38UL << XBAR_TECR_TESEL_POS) /*!< PF12 */
#define XBAR_TMR6_EMB_PF13         (39UL << XBAR_TECR_TESEL_POS) /*!< PF13 */
#define XBAR_TMR6_EMB_PF14         (40UL << XBAR_TECR_TESEL_POS) /*!< PF14 */
#define XBAR_TMR6_EMB_PF15         (41UL << XBAR_TECR_TESEL_POS) /*!< PF15 */
#define XBAR_TMR6_EMB_PG0          (42UL << XBAR_TECR_TESEL_POS) /*!< PG0 */
#define XBAR_TMR6_EMB_PG1          (43UL << XBAR_TECR_TESEL_POS) /*!< PG1 */
#define XBAR_TMR6_EMB_PG2          (44UL << XBAR_TECR_TESEL_POS) /*!< PG2 */
#define XBAR_TMR6_EMB_PG3          (45UL << XBAR_TECR_TESEL_POS) /*!< PG3 */
#define XBAR_TMR6_EMB_PG4          (46UL << XBAR_TECR_TESEL_POS) /*!< PG4 */
#define XBAR_TMR6_EMB_PG5          (47UL << XBAR_TECR_TESEL_POS) /*!< PG5 */
#define XBAR_TMR6_EMB_PG6          (48UL << XBAR_TECR_TESEL_POS) /*!< PG6 */
#define XBAR_TMR6_EMB_PG7          (49UL << XBAR_TECR_TESEL_POS) /*!< PG7 */
#define XBAR_TMR6_EMB_PG8          (50UL << XBAR_TECR_TESEL_POS) /*!< PG8 */
#define XBAR_TMR6_EMB_PG9          (51UL << XBAR_TECR_TESEL_POS) /*!< PG9 */
#define XBAR_TMR6_EMB_SDFM_BK0     (52UL << XBAR_TECR_TESEL_POS) /*!< SDFM_BK0 */
#define XBAR_TMR6_EMB_SDFM_BK1     (53UL << XBAR_TECR_TESEL_POS) /*!< SDFM_BK1 */
#define XBAR_TMR6_EMB_SDFM_BK2     (54UL << XBAR_TECR_TESEL_POS) /*!< SDFM_BK2 */
#define XBAR_TMR6_EMB_SDFM_BK3     (55UL << XBAR_TECR_TESEL_POS) /*!< SDFM_BK3 */
#define XBAR_TMR6_EMB_SDFM_CEVT1_0 (56UL << XBAR_TECR_TESEL_POS) /*!< SDFM_CEVT1_0 */
#define XBAR_TMR6_EMB_SDFM_CEVT1_1 (57UL << XBAR_TECR_TESEL_POS) /*!< SDFM_CEVT1_1 */
#define XBAR_TMR6_EMB_SDFM_CEVT1_2 (58UL << XBAR_TECR_TESEL_POS) /*!< SDFM_CEVT1_2 */
#define XBAR_TMR6_EMB_SDFM_CEVT1_3 (59UL << XBAR_TECR_TESEL_POS) /*!< SDFM_CEVT1_3 */
#define XBAR_TMR6_EMB_SDFM_CEVT2_0 (60UL << XBAR_TECR_TESEL_POS) /*!< SDFM_CEVT2_0 */
#define XBAR_TMR6_EMB_SDFM_CEVT2_1 (61UL << XBAR_TECR_TESEL_POS) /*!< SDFM_CEVT2_1 */
#define XBAR_TMR6_EMB_SDFM_CEVT2_2 (62UL << XBAR_TECR_TESEL_POS) /*!< SDFM_CEVT2_2 */
#define XBAR_TMR6_EMB_SDFM_CEVT2_3 (63UL << XBAR_TECR_TESEL_POS) /*!< SDFM_CEVT2_3 */
#define XBAR_TMR6_EMB_SDFM_ZCD0    (64UL << XBAR_TECR_TESEL_POS) /*!< SDFM_ZCD0 */
#define XBAR_TMR6_EMB_SDFM_ZCD1    (65UL << XBAR_TECR_TESEL_POS) /*!< SDFM_ZCD1 */
#define XBAR_TMR6_EMB_SDFM_ZCD2    (66UL << XBAR_TECR_TESEL_POS) /*!< SDFM_ZCD2 */
#define XBAR_TMR6_EMB_SDFM_ZCD3    (67UL << XBAR_TECR_TESEL_POS) /*!< SDFM_ZCD3 */
/**
 * @}
 */

/**
 * @defgroup XBAR_TRLPWM_Event_Selection XBAR TRLPWM Event Selection
 * @{
 */
#define XBAR_TRLPWM_PLA_OUT0   (0UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT0 */
#define XBAR_TRLPWM_PLA_OUT1   (1UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT1 */
#define XBAR_TRLPWM_PLA_OUT2   (2UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT2 */
#define XBAR_TRLPWM_PLA_OUT3   (3UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT3 */
#define XBAR_TRLPWM_PLA_OUT4   (4UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT4 */
#define XBAR_TRLPWM_PLA_OUT5   (5UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT5 */
#define XBAR_TRLPWM_PLA_OUT6   (6UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT6 */
#define XBAR_TRLPWM_PLA_OUT7   (7UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT7 */
#define XBAR_TRLPWM_PLA_OUT8   (8UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT8 */
#define XBAR_TRLPWM_PLA_OUT9   (9UL << XBAR_TRLCR_TRLSEL_POS)  /*!< PLA_OUT9 */
#define XBAR_TRLPWM_PLA_OUT10  (10UL << XBAR_TRLCR_TRLSEL_POS) /*!< PLA_OUT10 */
#define XBAR_TRLPWM_PLA_OUT11  (11UL << XBAR_TRLCR_TRLSEL_POS) /*!< PLA_OUT11 */
#define XBAR_TRLPWM_PLA_OUT12  (12UL << XBAR_TRLCR_TRLSEL_POS) /*!< PLA_OUT12 */
#define XBAR_TRLPWM_PLA_OUT13  (13UL << XBAR_TRLCR_TRLSEL_POS) /*!< PLA_OUT13 */
#define XBAR_TRLPWM_PLA_OUT14  (14UL << XBAR_TRLCR_TRLSEL_POS) /*!< PLA_OUT14 */
#define XBAR_TRLPWM_PLA_OUT15  (15UL << XBAR_TRLCR_TRLSEL_POS) /*!< PLA_OUT15 */
#define XBAR_TRLPWM_TMR6_EMB0  (16UL << XBAR_TRLCR_TRLSEL_POS) /*!< TMR6_EMB0 */
#define XBAR_TRLPWM_TMR6_EMB1  (17UL << XBAR_TRLCR_TRLSEL_POS) /*!< TMR6_EMB1 */
#define XBAR_TRLPWM_TMR6_EMB2  (18UL << XBAR_TRLCR_TRLSEL_POS) /*!< TMR6_EMB2 */
#define XBAR_TRLPWM_TMR6_EMB3  (19UL << XBAR_TRLCR_TRLSEL_POS) /*!< TMR6_EMB3 */
#define XBAR_TRLPWM_TMR6_EMB4  (20UL << XBAR_TRLCR_TRLSEL_POS) /*!< TMR6_EMB4 */
#define XBAR_TRLPWM_TMR6_EMB5  (21UL << XBAR_TRLCR_TRLSEL_POS) /*!< TMR6_EMB5 */
#define XBAR_TRLPWM_HRPWM_EMB0 (22UL << XBAR_TRLCR_TRLSEL_POS) /*!< HRPWM_EMB0 */
#define XBAR_TRLPWM_HRPWM_EMB1 (23UL << XBAR_TRLCR_TRLSEL_POS) /*!< HRPWM_EMB1 */
#define XBAR_TRLPWM_HRPWM_EMB2 (24UL << XBAR_TRLCR_TRLSEL_POS) /*!< HRPWM_EMB2 */
#define XBAR_TRLPWM_HRPWM_EMB3 (25UL << XBAR_TRLCR_TRLSEL_POS) /*!< HRPWM_EMB3 */
#define XBAR_TRLPWM_HRPWM_EMB4 (26UL << XBAR_TRLCR_TRLSEL_POS) /*!< HRPWM_EMB4 */
#define XBAR_TRLPWM_HRPWM_EMB5 (27UL << XBAR_TRLCR_TRLSEL_POS) /*!< HRPWM_EMB5 */
#define XBAR_TRLPWM_HRPWM_EMB6 (28UL << XBAR_TRLCR_TRLSEL_POS) /*!< HRPWM_EMB6 */
#define XBAR_TRLPWM_HRPWM_EMB7 (29UL << XBAR_TRLCR_TRLSEL_POS) /*!< HRPWM_EMB7 */
    /**
     * @}
     */

