MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_xbar.h
    /**
     * @}
     */
    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

    /*******************************************************************************
  Global function prototypes (definition in C source)
     ******************************************************************************/
    /**
     * @addtogroup XBAR_Global_Functions
     * @{
     */
    int32_t XBAR_DeInit(CM_XBAR_TypeDef *XBARx);

    int32_t XBAR_HRPWM_ExtEventStructInit(stc_xbar_hrpwm_ext_event_init_t *pstcXbarHrpwmExtEventInit);
    int32_t XBAR_HRPWM_ExtEventInit(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch,
                                    const stc_xbar_hrpwm_ext_event_init_t *pstcXbarHrpwmExtEventInit);
    void XBAR_HRPWM_SetEvent1(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32Event1);
    void XBAR_HRPWM_SetEvent2(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32Event2);
    void XBAR_HRPWM_SetEvent3(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32Event3);

    int32_t XBAR_HRPWM_MdbIclStructInit(stc_xbar_hrpwm_mdb_icl_init_t *pstcXbarHrpwmMdbIclInit);
    int32_t XBAR_HRPWM_MdbIclInit(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch,
                                  const stc_xbar_hrpwm_mdb_icl_init_t *pstcXbarHrpwmMdbIclInit);
    void XBAR_HRPWM_SetMinDBEvent(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32MinDBEvent);
    void XBAR_HRPWM_SetIllegalInputEvent(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32ICLEvent);

    int32_t XBAR_HRPWMEMB_StructInit(stc_xbar_hrpwm_emb_init_t *pstcXbarHrpwmEmbInit);
    int32_t XBAR_HRPWMEMB_Init(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch,
                               const stc_xbar_hrpwm_emb_init_t *pstcXbarHrpwmEmbInit);
    void XBAR_HRPWMEMB_SetEvent1(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32Event1);
    void XBAR_HRPWMEMB_SetEvent2(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32Event2);
    void XBAR_HRPWMEMB_SetEvent3(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32Event3);

    void XBAR_TMR6EMB_SetEvent(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32Event);

    void XBAR_TRLPWM_SetEvent(CM_XBAR_TypeDef *XBARx, uint32_t u32Ch, uint32_t u32Event);
    /**
     * @}
     */

#endif /* LL_XBAR_ENABLE */

    /**
     * @}
     */

    /**
     * @}
     */

#ifdef __cplusplus
}
#endif

#endif /* __HC32_LL_XBAR_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
